-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Oct 10, 2026 at 05:33 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `arenascrim_test`
--

-- --------------------------------------------------------

--
-- Table structure for table `heroes`
--

CREATE TABLE `heroes` (
  `hero_id` int(11) NOT NULL,
  `hero_name` varchar(50) NOT NULL,
  `hero_role` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `heroes`
--

INSERT INTO `heroes` (`hero_id`, `hero_name`, `hero_role`) VALUES
(1, 'Allain', 'Dark Slayer'),
(2, 'Bijan', 'Dark Slayer'),
(3, 'Charlotte', 'Dark Slayer'),
(4, 'Dextra', 'Dark Slayer'),
(5, 'Errol', 'Dark Slayer'),
(6, 'Florentino', 'Dark Slayer'),
(7, 'Lu Bu', 'Dark Slayer'),
(8, 'Maloch', 'Dark Slayer'),
(9, 'Omen', 'Dark Slayer'),
(10, 'Qi', 'Dark Slayer'),
(11, 'Riktor', 'Dark Slayer'),
(12, 'Roxie', 'Dark Slayer'),
(13, 'Skud', 'Dark Slayer'),
(14, 'Tachi', 'Dark Slayer'),
(15, 'Yena', 'Dark Slayer'),
(17, 'Aoi', 'Jungle'),
(18, 'Biron', 'Jungle'),
(19, 'Butterfly', 'Jungle'),
(20, 'Enzo', 'Jungle'),
(21, 'Keera', 'Jungle'),
(22, 'Kriknak', 'Jungle'),
(23, 'Murad', 'Jungle'),
(24, 'Nakroth', 'Jungle'),
(25, 'Pain', 'Jungle'),
(26, 'Quillen', 'Jungle'),
(27, 'Sinestrea', 'Jungle'),
(28, 'Wukong', 'Jungle'),
(29, 'Yan', 'Jungle'),
(30, 'Zill', 'Jungle'),
(31, 'Zephys', 'Jungle'),
(32, 'Aleister', 'Mid Lane'),
(33, 'Azzen\'Ka', 'Mid Lane'),
(34, 'Diao Chan', 'Mid Lane'),
(35, 'Dirak', 'Mid Lane'),
(36, 'Iggy', 'Mid Lane'),
(37, 'Ilumia', 'Mid Lane'),
(38, 'Jinna', 'Mid Lane'),
(39, 'Kahlii', 'Mid Lane'),
(40, 'Krixi', 'Mid Lane'),
(41, 'Lauriel', 'Mid Lane'),
(42, 'Liliana', 'Mid Lane'),
(43, 'Lorion', 'Mid Lane'),
(44, 'Manga', 'Mid Lane'),
(45, 'Marja', 'Mid Lane'),
(46, 'Natalya', 'Mid Lane'),
(47, 'Preyta', 'Mid Lane'),
(48, 'Raz', 'Mid Lane'),
(49, 'Sephera', 'Mid Lane'),
(50, 'Tulen', 'Mid Lane'),
(51, 'Veera', 'Mid Lane'),
(52, 'Yue', 'Mid Lane'),
(53, 'Capheny', 'Dragon Lane'),
(54, 'Celica', 'Dragon Lane'),
(55, 'Eland\'orr', 'Dragon Lane'),
(56, 'Elsu', 'Dragon Lane'),
(57, 'Hayate', 'Dragon Lane'),
(58, 'Joker', 'Dragon Lane'),
(59, 'Klass', 'Dragon Lane'),
(60, 'Laville', 'Dragon Lane'),
(61, 'Moren', 'Dragon Lane'),
(62, 'Slimz', 'Dragon Lane'),
(63, 'Stacia', 'Dragon Lane'),
(64, 'Teeri', 'Dragon Lane'),
(65, 'Tel\'Annas', 'Dragon Lane'),
(66, 'Thorne', 'Dragon Lane'),
(67, 'Valhein', 'Dragon Lane'),
(68, 'Violet', 'Dragon Lane'),
(69, 'Wisp', 'Dragon Lane'),
(70, 'Yorn', 'Dragon Lane'),
(71, 'Alice', 'Support / Tank'),
(72, 'Annette', 'Support / Tank'),
(73, 'Arum', 'Support / Tank'),
(74, 'Aya', 'Support / Tank'),
(75, 'Baldum', 'Support / Tank'),
(76, 'Chaugnar', 'Support / Tank'),
(77, 'Cresht', 'Support / Tank'),
(78, 'Gildur', 'Support / Tank'),
(79, 'Grakk', 'Support / Tank'),
(80, 'Helen', 'Support / Tank'),
(81, 'Krouros', 'Support / Tank'),
(82, 'Lumburr', 'Support / Tank'),
(83, 'Mina', 'Support / Tank'),
(84, 'Ming', 'Support / Tank'),
(85, 'Ormarr', 'Support / Tank'),
(86, 'TeeMee', 'Support / Tank'),
(87, 'Thane', 'Support / Tank'),
(88, 'Toro', 'Support / Tank'),
(89, 'Wonder Woman', 'Support / Tank'),
(90, 'Xeniel', 'Support / Tank'),
(91, 'Y\'bneth', 'Support / Tank'),
(92, 'Zip', 'Support / Tank');

-- --------------------------------------------------------

--
-- Table structure for table `login_attempts`
--

CREATE TABLE `login_attempts` (
  `attempt_id` int(11) NOT NULL,
  `login_key` varchar(100) NOT NULL COMMENT 'username/email ที่กรอก (ตัวพิมพ์เล็ก)',
  `attempted_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `match_player_stats`
--

CREATE TABLE `match_player_stats` (
  `stat_id` int(11) NOT NULL,
  `match_id` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `hero_name` varchar(50) NOT NULL,
  `kills` int(11) DEFAULT 0,
  `deaths` int(11) DEFAULT 0,
  `assists` int(11) DEFAULT 0,
  `mvp_score` decimal(3,1) DEFAULT 0.0,
  `gold` int(11) DEFAULT 0,
  `damage_dealt` int(11) DEFAULT 0,
  `damage_taken` int(11) DEFAULT 0,
  `participation_rate` decimal(4,1) DEFAULT 0.0,
  `gold_share` decimal(5,2) DEFAULT 0.00 COMMENT '% เงินของทีม',
  `damage_share` decimal(5,2) DEFAULT 0.00 COMMENT '% ดาเมจที่ทำ',
  `taken_share` decimal(5,2) DEFAULT 0.00 COMMENT '% ดาเมจที่รับ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `match_player_stats`
--

INSERT INTO `match_player_stats` (`stat_id`, `match_id`, `member_id`, `hero_name`, `kills`, `deaths`, `assists`, `mvp_score`, `gold`, `damage_dealt`, `damage_taken`, `participation_rate`, `gold_share`, `damage_share`, `taken_share`) VALUES
(99, 26, 55, 'Tachi', 2, 4, 3, 6.1, 8670, 45951, 117912, 50.0, 18.90, 12.30, 26.90),
(100, 26, 56, 'Yan', 2, 7, 6, 5.8, 10380, 95496, 55014, 80.0, 22.70, 25.50, 12.50),
(101, 26, 57, 'Krixi', 3, 6, 6, 4.9, 9645, 110917, 73302, 90.0, 21.10, 29.60, 16.70),
(102, 26, 58, 'Stacia', 3, 7, 2, 4.5, 10260, 95418, 80028, 50.0, 22.40, 25.40, 18.20),
(103, 26, 59, 'Wonder Woman', 0, 5, 1, 4.5, 6825, 27300, 112612, 10.0, 14.90, 7.30, 25.70),
(104, 27, 55, 'Lu Bu', 0, 4, 6, 5.3, 9673, 47397, 147029, 100.0, 18.70, 11.80, 28.10),
(105, 27, 56, 'Biron', 0, 4, 4, 4.6, 11713, 113616, 85504, 100.0, 22.60, 28.20, 16.30),
(106, 27, 57, 'Manga', 1, 5, 6, 4.4, 10897, 98073, 76279, 100.0, 21.10, 24.40, 14.60),
(107, 27, 58, 'Joker', 2, 7, 1, 4.4, 11934, 107406, 107406, 100.0, 23.10, 26.70, 20.50),
(108, 27, 59, 'Toro', 0, 7, 6, 5.6, 7531, 36148, 107693, 100.0, 14.60, 9.00, 20.60),
(109, 28, 55, 'Tachi', 0, 4, 10, 7.7, 10400, 72800, 141440, 40.0, 17.20, 13.00, 27.60),
(110, 28, 56, 'Butterfly', 7, 0, 11, 16.0, 14420, 155736, 77868, 72.0, 23.80, 27.70, 15.20),
(111, 28, 57, 'Krixi', 7, 2, 6, 10.2, 12680, 150892, 103976, 52.0, 20.90, 26.80, 20.30),
(112, 28, 58, 'Joker', 10, 1, 9, 16.0, 14080, 132352, 71808, 76.0, 23.20, 23.50, 14.00),
(113, 28, 59, 'Wonder Woman', 1, 2, 5, 8.3, 8980, 50288, 116740, 24.0, 14.80, 8.90, 22.80),
(114, 29, 55, 'Skud', 1, 3, 6, 5.8, 7215, 38961, 121933, 100.0, 17.70, 10.80, 29.20),
(115, 29, 56, 'Butterfly', 1, 4, 2, 5.2, 9230, 94146, 79378, 100.0, 22.60, 26.20, 19.00),
(116, 29, 57, 'Manga', 0, 4, 2, 3.8, 8736, 99590, 63772, 66.7, 21.40, 27.70, 15.30),
(117, 29, 58, 'Yorn', 1, 6, 1, 4.1, 9802, 101940, 66653, 66.7, 24.00, 28.30, 16.00),
(118, 29, 59, 'Lumburr', 0, 7, 4, 5.0, 5811, 24987, 85421, 100.0, 14.20, 6.90, 20.50),
(119, 30, 55, 'Lu Bu', 2, 4, 12, 8.5, 11514, 77143, 145076, 60.9, 19.80, 14.60, 28.00),
(120, 30, 56, 'Yan', 4, 3, 6, 9.5, 13262, 153839, 68962, 43.5, 22.80, 29.10, 13.30),
(121, 30, 57, 'Krixi', 9, 0, 12, 16.0, 13851, 138510, 120503, 91.3, 23.80, 26.20, 23.30),
(122, 30, 58, 'Stacia', 8, 3, 8, 10.0, 12255, 122550, 66177, 69.6, 21.10, 23.10, 12.80),
(123, 30, 59, 'Wonder Woman', 0, 2, 9, 9.0, 7334, 37403, 117344, 39.1, 12.60, 7.10, 22.70),
(124, 31, 55, 'Skud', 1, 3, 5, 6.2, 7579, 42442, 115200, 66.7, 19.10, 11.80, 32.50),
(125, 31, 56, 'Butterfly', 3, 6, 5, 5.0, 9022, 82100, 62251, 88.9, 22.80, 22.80, 17.50),
(126, 31, 57, 'Manga', 1, 3, 3, 5.6, 8827, 114751, 45017, 44.4, 22.30, 31.90, 12.70),
(127, 31, 58, 'Yorn', 4, 4, 4, 5.2, 8619, 88775, 43095, 88.9, 21.80, 24.70, 12.10),
(128, 31, 59, 'Lumburr', 0, 2, 5, 5.6, 5551, 31640, 89371, 55.6, 14.00, 8.80, 25.20),
(129, 32, 55, 'Lu Bu', 2, 3, 2, 4.7, 13354, 64099, 170931, 25.0, 19.70, 10.70, 27.10),
(130, 32, 56, 'Butterfly', 5, 3, 1, 5.1, 15422, 175810, 106411, 37.5, 22.70, 29.50, 16.90),
(131, 32, 57, 'Manga', 5, 4, 6, 5.9, 14828, 142348, 112692, 68.8, 21.80, 23.80, 17.90),
(132, 32, 58, 'Joker', 3, 7, 1, 4.9, 14828, 169039, 124555, 25.0, 21.80, 28.30, 19.80),
(133, 32, 59, 'Toro', 1, 7, 2, 5.0, 9504, 45619, 115948, 18.8, 14.00, 7.60, 18.40),
(134, 33, 55, 'Lu Bu', 1, 0, 3, 9.2, 9864, 59184, 126259, 15.4, 17.00, 10.30, 26.50),
(135, 33, 56, 'Biron', 8, 1, 10, 16.0, 13518, 170326, 82459, 69.2, 23.30, 29.60, 17.30),
(136, 33, 57, 'Krixi', 5, 3, 7, 9.8, 13554, 170780, 81324, 46.2, 23.40, 29.70, 17.10),
(137, 33, 58, 'Joker', 10, 0, 11, 16.0, 12690, 119286, 74871, 80.8, 21.90, 20.70, 15.70),
(138, 33, 59, 'Lumburr', 2, 0, 8, 13.2, 8280, 56304, 111780, 38.5, 14.30, 9.80, 23.40),
(139, 34, 55, 'Skud', 2, 3, 11, 9.1, 11720, 82040, 181660, 81.3, 19.50, 13.40, 32.60),
(140, 34, 56, 'Butterfly', 3, 3, 5, 8.4, 13400, 168840, 84420, 50.0, 22.30, 27.50, 15.20),
(141, 34, 57, 'Krixi', 7, 1, 6, 15.2, 13040, 163000, 66504, 81.3, 21.70, 26.50, 11.90),
(142, 34, 58, 'Stacia', 3, 3, 10, 10.6, 13120, 140384, 74784, 81.3, 21.80, 22.90, 13.40),
(143, 34, 59, 'Lumburr', 1, 3, 11, 8.8, 8800, 59840, 149600, 75.0, 14.60, 9.70, 26.90),
(144, 35, 55, 'Tachi', 2, 7, 3, 5.1, 8672, 53766, 126611, 83.3, 17.90, 13.60, 27.10),
(145, 35, 56, 'Butterfly', 0, 7, 6, 5.3, 10240, 92160, 80896, 100.0, 21.10, 23.30, 17.30),
(146, 35, 57, 'Manga', 2, 5, 4, 4.8, 11888, 111747, 64195, 100.0, 24.50, 28.30, 13.70),
(147, 35, 58, 'Stacia', 0, 5, 6, 5.2, 10400, 102960, 79040, 100.0, 21.50, 26.10, 16.90),
(148, 35, 59, 'Toro', 2, 4, 2, 5.7, 7280, 34216, 116480, 66.7, 15.00, 8.70, 24.90),
(149, 36, 55, 'Lu Bu', 0, 5, 1, 3.9, 11200, 49280, 162400, 10.0, 17.90, 8.70, 26.90),
(150, 36, 56, 'Yan', 2, 4, 6, 6.2, 13420, 174460, 100650, 80.0, 21.50, 30.70, 16.70),
(151, 36, 57, 'Jinna', 5, 3, 6, 6.2, 14080, 133760, 73216, 100.0, 22.50, 23.60, 12.10),
(152, 36, 58, 'Yorn', 1, 6, 2, 4.4, 15000, 162000, 126000, 30.0, 24.00, 28.50, 20.90),
(153, 36, 59, 'Wonder Woman', 2, 7, 6, 4.5, 8800, 48400, 141680, 80.0, 14.10, 8.50, 23.50),
(154, 37, 55, 'Tachi', 2, 5, 5, 5.9, 5753, 37969, 89746, 70.0, 17.70, 12.20, 27.10),
(155, 37, 56, 'Yan', 0, 2, 5, 6.3, 7436, 81796, 41641, 50.0, 22.80, 26.40, 12.60),
(156, 37, 57, 'Krixi', 5, 2, 4, 7.5, 7084, 90675, 60922, 90.0, 21.70, 29.20, 18.40),
(157, 37, 58, 'Stacia', 1, 7, 2, 4.6, 7623, 73943, 63270, 30.0, 23.40, 23.80, 19.10),
(158, 37, 59, 'Toro', 2, 5, 6, 4.9, 4675, 25712, 75267, 80.0, 14.40, 8.30, 22.70),
(159, 38, 60, 'Allain', 4, 1, 3, 9.0, 8000, 20000, 15000, 70.0, 26.70, 27.80, 25.00),
(160, 38, 62, 'Aoi', 3, 2, 4, 8.0, 7000, 18000, 12000, 70.0, 23.30, 25.00, 20.00),
(161, 38, 64, 'Tulen', 2, 1, 5, 7.5, 6000, 16000, 8000, 70.0, 20.00, 22.20, 13.30),
(162, 38, 66, 'Violet', 1, 0, 6, 7.0, 5000, 14000, 6000, 70.0, 16.70, 19.40, 10.00),
(163, 38, 68, 'Zip', 0, 2, 8, 6.5, 4000, 4000, 19000, 80.0, 13.30, 5.60, 31.70),
(164, 39, 60, 'Allain', 1, 2, 1, 5.0, 5000, 10000, 10000, 40.0, 20.00, 20.00, 20.00),
(165, 39, 62, 'Aoi', 1, 2, 1, 5.0, 5000, 10000, 10000, 40.0, 20.00, 20.00, 20.00),
(166, 39, 64, 'Tulen', 1, 2, 1, 5.0, 5000, 10000, 10000, 40.0, 20.00, 20.00, 20.00),
(167, 39, 66, 'Violet', 1, 2, 1, 5.0, 5000, 10000, 10000, 40.0, 20.00, 20.00, 20.00),
(168, 39, 68, 'Zip', 1, 2, 1, 5.0, 5000, 10000, 10000, 40.0, 20.00, 20.00, 20.00),
(169, 40, 70, 'Aoi', 1, 1, 1, 6.0, 5000, 1000, 1000, 100.0, 100.00, 100.00, 100.00),
(170, 41, 70, 'Aoi', 1, 1, 1, 6.0, 5000, 1000, 1000, 100.0, 100.00, 100.00, 100.00),
(188, 47, 72, 'Aoi', 50, 50, 55, 6.0, 5000, 1000, 1000, 100.0, 100.00, 100.00, 100.00),
(189, 48, 72, 'Aoi', 50, 50, 57, 6.0, 5000, 1000, 1000, 100.0, 100.00, 100.00, 100.00),
(190, 49, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(191, 49, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(192, 49, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(193, 49, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(194, 49, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(195, 50, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(196, 50, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(197, 50, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(198, 50, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(199, 50, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(200, 51, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(201, 51, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(202, 51, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(203, 51, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(204, 51, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(205, 52, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(206, 52, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(207, 52, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(208, 52, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(209, 52, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(210, 53, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(211, 53, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(212, 53, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(213, 53, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(214, 53, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(215, 54, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(216, 54, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(217, 54, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(218, 54, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(219, 54, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(220, 55, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(221, 55, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(222, 55, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(223, 55, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(224, 55, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(225, 56, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(226, 56, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(227, 56, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(228, 56, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(229, 56, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(230, 57, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(231, 57, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(232, 57, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(233, 57, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(234, 57, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(235, 58, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(236, 58, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(237, 58, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(238, 58, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(239, 58, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(240, 59, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(241, 59, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(242, 59, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(243, 59, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(244, 59, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(245, 60, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(246, 60, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(247, 60, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(248, 60, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(249, 60, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(250, 61, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(251, 61, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(252, 61, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(253, 61, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(254, 61, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(255, 62, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(256, 62, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(257, 62, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(258, 62, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(259, 62, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(260, 63, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(261, 63, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(262, 63, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(263, 63, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(264, 63, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(265, 64, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(266, 64, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(267, 64, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(268, 64, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(269, 64, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(270, 65, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(271, 65, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(272, 65, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(273, 65, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(274, 65, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(275, 66, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(276, 66, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(277, 66, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(278, 66, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(279, 66, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(280, 67, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(281, 67, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(282, 67, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(283, 67, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(284, 67, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(285, 68, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(286, 68, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(287, 68, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(288, 68, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(289, 68, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(290, 69, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(291, 69, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(292, 69, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(293, 69, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(294, 69, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(295, 70, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(296, 70, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(297, 70, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(298, 70, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(299, 70, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(300, 71, 60, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(301, 71, 62, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(302, 71, 64, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(303, 71, 66, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(304, 71, 68, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 40.0, 20.00, 20.00, 20.00),
(325, 74, 60, 'Aoi', 2, 1, 3, 7.0, 5000, 9000, 8000, 50.0, 20.00, 20.00, 20.00),
(326, 74, 62, 'Aoi', 2, 1, 3, 7.0, 5000, 9000, 8000, 50.0, 20.00, 20.00, 20.00),
(327, 74, 64, 'Aoi', 2, 1, 3, 7.0, 5000, 9000, 8000, 50.0, 20.00, 20.00, 20.00),
(328, 74, 66, 'Aoi', 2, 1, 3, 7.0, 5000, 9000, 8000, 50.0, 20.00, 20.00, 20.00),
(329, 74, 68, 'Aoi', 2, 1, 3, 7.0, 5000, 9000, 8000, 50.0, 20.00, 20.00, 20.00),
(330, 75, 61, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 50.0, 25.00, 25.00, 25.00),
(331, 75, 63, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 50.0, 25.00, 25.00, 25.00),
(332, 75, 65, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 50.0, 25.00, 25.00, 25.00),
(333, 75, 67, 'Aoi', 1, 1, 1, 5.0, 1000, 1000, 1000, 50.0, 25.00, 25.00, 25.00);

-- --------------------------------------------------------

--
-- Table structure for table `scrim_matches`
--

CREATE TABLE `scrim_matches` (
  `match_id` int(11) NOT NULL,
  `team_id` int(11) NOT NULL,
  `series_id` int(11) DEFAULT NULL,
  `opponent_name` varchar(100) NOT NULL,
  `match_result` enum('WIN','LOSS') NOT NULL,
  `match_date` datetime DEFAULT current_timestamp(),
  `match_type` varchar(10) DEFAULT 'Bo3',
  `game_number` int(11) DEFAULT 1,
  `match_duration` varchar(10) DEFAULT NULL,
  `replay_url` varchar(255) DEFAULT NULL,
  `match_note` text DEFAULT NULL,
  `enemy_hero_1` varchar(50) DEFAULT NULL,
  `enemy_hero_2` varchar(50) DEFAULT NULL,
  `enemy_hero_3` varchar(50) DEFAULT NULL,
  `enemy_hero_4` varchar(50) DEFAULT NULL,
  `enemy_hero_5` varchar(50) DEFAULT NULL,
  `match_image_url` varchar(255) DEFAULT NULL,
  `team_dragons` int(11) DEFAULT 0,
  `team_slayers` int(11) DEFAULT 0,
  `team_towers` int(11) DEFAULT 0,
  `first_dragon` tinyint(1) DEFAULT 0,
  `first_tower` tinyint(1) DEFAULT 0,
  `team_god_slayers` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `scrim_matches`
--

INSERT INTO `scrim_matches` (`match_id`, `team_id`, `series_id`, `opponent_name`, `match_result`, `match_date`, `match_type`, `game_number`, `match_duration`, `replay_url`, `match_note`, `enemy_hero_1`, `enemy_hero_2`, `enemy_hero_3`, `enemy_hero_4`, `enemy_hero_5`, `match_image_url`, `team_dragons`, `team_slayers`, `team_towers`, `first_dragon`, `first_tower`, `team_god_slayers`) VALUES
(26, 18, 1, 'Bacon Time', 'LOSS', '2026-09-10 21:00:00', 'Bo1', 1, '15:13', NULL, 'ดราฟต์ดี ป่าคุมจังหวะได้ตั้งแต่ต้น เก็บมังกรตัวแรกได้ไว', 'Pain', 'Zephys', 'Aleister', 'Dirak', 'Krixi', NULL, 0, 0, 3, 1, 0, 0),
(27, 18, 3, 'Buriram United Esports', 'LOSS', '2026-09-12 20:00:00', 'Bo3', 1, '17:36', NULL, 'ออฟเลนโดนเติม 3 คนบ่อยช่วงต้นเกม ซัพต้องโรมมาช่วยเร็วกว่านี้', 'Azzen\'Ka', 'Veera', 'Krouros', 'Ormarr', 'Thane', NULL, 0, 1, 3, 0, 0, 0),
(28, 18, 10, 'Talon Esports', 'WIN', '2026-09-14 23:00:00', 'Bo3', 1, '20:12', NULL, 'ไฟต์ Dark Slayer ตัวแรกสื่อสารพลาด เข้าไม่พร้อมกัน', 'Yan', 'Diao Chan', 'Eland\'orr', 'Joker', 'TeeMee', NULL, 3, 3, 7, 0, 1, 1),
(29, 18, 8, 'King of Gamers', 'LOSS', '2026-09-16 21:00:00', 'Bo1', 1, '13:25', NULL, 'แครี่ฟาร์มดีมาก ไลน์อัพสายเลทเกมเห็นผล', 'Murad', 'Lauriel', 'Manga', 'Tulen', 'TeeMee', NULL, 1, 0, 1, 0, 0, 0),
(30, 18, 4, 'eArena', 'WIN', '2026-09-18 21:00:00', 'Bo3', 1, '19:37', NULL, 'โดนปิดเกมเร็ว วอร์ดป่าฝั่งเราไม่พอ ต้องซ้อมวิชั่นเพิ่ม', 'Aoi', 'Aleister', 'Krixi', 'Elsu', 'Aya', NULL, 4, 3, 8, 1, 1, 1),
(31, 18, 12, 'Valencia CF Esports', 'LOSS', '2026-09-20 23:00:00', 'Bo3', 2, '13:04', NULL, 'ชนะไฟต์ทีมช่วงท้ายเกมได้ เพราะมิดเก็บ 3 คนได้ในจังหวะเดียว', 'Charlotte', 'Zephys', 'Marja', 'Sephera', 'Yue', NULL, 0, 0, 3, 0, 0, 0),
(32, 18, 6, 'Full Sense', 'LOSS', '2026-09-22 20:00:00', 'Bo1', 1, '22:29', NULL, NULL, 'Dirak', 'Veera', 'Stacia', 'Annette', 'TeeMee', NULL, 0, 1, 1, 0, 0, 0),
(33, 18, 2, 'Bacon Time', 'WIN', '2026-09-24 20:00:00', 'Bo3', 2, '18:10', NULL, 'ดราฟต์ดี ป่าคุมจังหวะได้ตั้งแต่ต้น เก็บมังกรตัวแรกได้ไว', 'Raz', 'Elsu', 'Moren', 'Arum', 'Wonder Woman', NULL, 2, 3, 5, 0, 1, 1),
(34, 18, 11, 'Talon Esports', 'WIN', '2026-09-26 21:00:00', 'Bo3', 2, '20:03', NULL, 'ออฟเลนโดนเติม 3 คนบ่อยช่วงต้นเกม ซัพต้องโรมมาช่วยเร็วกว่านี้', 'Riktor', 'Skud', 'Laville', 'Teeri', 'Gildur', NULL, 2, 2, 9, 1, 0, 1),
(35, 18, 9, 'King of Gamers', 'LOSS', '2026-09-28 23:00:00', 'Bo1', 1, '16:48', NULL, 'ไฟต์ Dark Slayer ตัวแรกสื่อสารพลาด เข้าไม่พร้อมกัน', 'Maloch', 'Skud', 'Tachi', 'Keera', 'Violet', NULL, 1, 1, 4, 0, 0, 0),
(36, 18, 5, 'eArena', 'LOSS', '2026-09-30 21:00:00', 'Bo3', 3, '20:32', NULL, 'แครี่ฟาร์มดีมาก ไลน์อัพสายเลทเกมเห็นผล', 'Charlotte', 'Wukong', 'Eland\'orr', 'Mina', 'Xeniel', NULL, 1, 1, 4, 1, 0, 0),
(37, 18, 7, 'Full Sense', 'LOSS', '2026-10-02 22:00:00', 'Bo3', 3, '11:09', NULL, 'โดนปิดเกมเร็ว วอร์ดป่าฝั่งเราไม่พอ ต้องซ้อมวิชั่นเพิ่ม', 'Charlotte', 'Quillen', 'Klass', 'Yorn', 'Grakk', NULL, 1, 1, 2, 0, 0, 0),
(38, 22, 16, 'Rival', 'WIN', '2026-10-05 00:00:00', 'Bo3', 1, '15:00', NULL, NULL, 'Zuka', 'Butterfly', NULL, NULL, NULL, NULL, 2, 1, 7, 1, 1, 0),
(39, 22, 17, 'Rival', 'LOSS', '2026-10-04 23:59:00', 'Bo3', 2, '20:30', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 0, 3, 0, 1, 0),
(40, 24, 18, 'Opp', 'WIN', '2026-09-30 23:59:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(41, 24, 19, 'Opp', 'LOSS', '2026-10-01 00:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(45, 23, 24, 'Inject', 'WIN', '2026-10-05 00:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(47, 27, 26, 'Opp', 'WIN', '2026-10-06 10:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(48, 27, 27, 'Opp', 'WIN', '2026-09-29 10:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(49, 22, 28, 'rival', 'WIN', '2026-10-05 00:00:00', 'Bo3', 1, '15:00', NULL, NULL, 'Zuka', NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(50, 22, 29, 'RIVAL', 'LOSS', '2026-10-05 00:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(51, 22, 30, 'Pg00', 'LOSS', '2026-09-01 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(52, 22, 31, 'Pg01', 'WIN', '2026-09-02 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(53, 22, 32, 'Pg02', 'LOSS', '2026-09-03 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(54, 22, 33, 'Pg03', 'WIN', '2026-09-04 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(55, 22, 34, 'Pg04', 'LOSS', '2026-09-05 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(56, 22, 35, 'Pg05', 'WIN', '2026-09-06 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(57, 22, 36, 'Pg06', 'LOSS', '2026-09-07 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(58, 22, 37, 'Pg07', 'WIN', '2026-09-08 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(59, 22, 38, 'Pg08', 'LOSS', '2026-09-09 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(60, 22, 39, 'Pg09', 'WIN', '2026-09-10 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(61, 22, 40, 'Pg10', 'LOSS', '2026-09-11 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(62, 22, 41, 'Pg11', 'WIN', '2026-09-12 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(63, 22, 42, 'Pg12', 'LOSS', '2026-09-13 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(64, 22, 43, 'Pg13', 'WIN', '2026-09-14 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(65, 22, 44, 'Pg14', 'LOSS', '2026-09-15 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(66, 22, 45, 'Pg15', 'WIN', '2026-09-16 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(67, 22, 46, 'Pg16', 'LOSS', '2026-09-17 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(68, 22, 47, 'Pg17', 'WIN', '2026-09-18 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(69, 22, 48, 'Pg18', 'LOSS', '2026-09-19 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(70, 22, 49, 'Pg19', 'WIN', '2026-09-20 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(71, 22, 50, 'Pg20', 'LOSS', '2026-09-21 12:00:00', 'Bo3', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(74, 22, 53, 'EvenBo', 'WIN', '2026-10-05 00:00:00', 'Bo2', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0),
(75, 23, 55, 'Team Alpha', 'WIN', '2026-10-05 00:00:00', 'Bo5', 1, '15:00', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `scrim_posts`
--

CREATE TABLE `scrim_posts` (
  `post_id` int(11) NOT NULL,
  `team_id` int(11) NOT NULL,
  `avg_rank` varchar(50) NOT NULL,
  `match_format` enum('BO1','BO2','BO3','BO4','BO5','BO6','BO7') DEFAULT 'BO3',
  `scrim_time` datetime NOT NULL,
  `note` text DEFAULT NULL,
  `status` enum('open','matched','expired') DEFAULT 'open',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `scrim_posts`
--

INSERT INTO `scrim_posts` (`post_id`, `team_id`, `avg_rank`, `match_format`, `scrim_time`, `note`, `status`, `created_at`) VALUES
(12, 23, 'Diamond', 'BO1', '2020-01-01 00:00:00', NULL, 'expired', '2026-10-09 21:02:49'),
(14, 22, 'Diamond', 'BO3', '2030-01-01 20:00:00', NULL, 'open', '2026-10-09 21:02:49'),
(15, 22, 'Diamond', 'BO2', '2030-01-02 20:00:00', NULL, 'open', '2026-10-09 21:02:55'),
(16, 22, 'Conqueror', 'BO5', '2030-02-01 20:00:00', NULL, 'matched', '2026-10-09 21:02:56'),
(17, 22, 'Diamond', 'BO1', '2030-03-01 20:00:00', NULL, 'matched', '2026-10-09 21:02:56'),
(18, 23, 'Diamond', 'BO3', '2030-04-01 20:00:00', NULL, 'expired', '2026-10-09 21:02:58'),
(19, 22, 'Diamond', 'BO3', '2030-04-02 20:00:00', NULL, 'open', '2026-10-09 21:02:58');

-- --------------------------------------------------------

--
-- Table structure for table `scrim_requests`
--

CREATE TABLE `scrim_requests` (
  `request_id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `team_id` int(11) NOT NULL COMMENT 'ทีมที่ขอซ้อม',
  `status` enum('pending','accepted','rejected','cancelled') NOT NULL DEFAULT 'pending',
  `message` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `responded_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `scrim_requests`
--

INSERT INTO `scrim_requests` (`request_id`, `post_id`, `team_id`, `status`, `message`, `created_at`, `responded_at`) VALUES
(1, 16, 23, 'accepted', 'สามทุ่มได้ไหม', '2026-10-09 21:02:56', '2026-10-10 04:02:56'),
(2, 16, 24, 'rejected', NULL, '2026-10-09 21:02:56', '2026-10-10 04:02:56'),
(3, 17, 24, 'rejected', NULL, '2026-10-09 21:02:56', '2026-10-10 04:02:57'),
(4, 18, 22, 'rejected', NULL, '2026-10-09 21:02:58', '2026-10-10 04:02:58'),
(5, 19, 23, 'cancelled', NULL, '2026-10-09 21:02:58', '2026-10-10 04:02:58');

-- --------------------------------------------------------

--
-- Table structure for table `scrim_series`
--

CREATE TABLE `scrim_series` (
  `series_id` int(11) NOT NULL,
  `team_id` int(11) NOT NULL,
  `opponent_name` varchar(100) NOT NULL,
  `best_of` tinyint(1) NOT NULL DEFAULT 3 COMMENT 'Bo1–Bo7 (D-30)',
  `series_date` datetime DEFAULT NULL COMMENT 'เวลานัด/เวลาเกมแรก',
  `request_id` int(11) DEFAULT NULL COMMENT 'มาจากคำขอซ้อมที่ถูกรับ (C4)',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `scrim_series`
--

INSERT INTO `scrim_series` (`series_id`, `team_id`, `opponent_name`, `best_of`, `series_date`, `request_id`, `created_at`) VALUES
(1, 18, 'Bacon Time', 1, '2026-09-10 21:00:00', NULL, '2026-10-09 21:02:45'),
(2, 18, 'Bacon Time', 3, '2026-09-24 20:00:00', NULL, '2026-10-09 21:02:45'),
(3, 18, 'Buriram United Esports', 3, '2026-09-12 20:00:00', NULL, '2026-10-09 21:02:45'),
(4, 18, 'eArena', 3, '2026-09-18 21:00:00', NULL, '2026-10-09 21:02:45'),
(5, 18, 'eArena', 3, '2026-09-30 21:00:00', NULL, '2026-10-09 21:02:45'),
(6, 18, 'Full Sense', 1, '2026-09-22 20:00:00', NULL, '2026-10-09 21:02:45'),
(7, 18, 'Full Sense', 3, '2026-10-02 22:00:00', NULL, '2026-10-09 21:02:45'),
(8, 18, 'King of Gamers', 1, '2026-09-16 21:00:00', NULL, '2026-10-09 21:02:45'),
(9, 18, 'King of Gamers', 1, '2026-09-28 23:00:00', NULL, '2026-10-09 21:02:45'),
(10, 18, 'Talon Esports', 3, '2026-09-14 23:00:00', NULL, '2026-10-09 21:02:45'),
(11, 18, 'Talon Esports', 3, '2026-09-26 21:00:00', NULL, '2026-10-09 21:02:45'),
(12, 18, 'Valencia CF Esports', 3, '2026-09-20 23:00:00', NULL, '2026-10-09 21:02:45'),
(16, 22, 'Rival', 3, '2026-10-05 00:00:00', NULL, '2026-10-09 21:02:48'),
(17, 22, 'Rival', 3, '2026-10-04 23:59:00', NULL, '2026-10-09 21:02:48'),
(18, 24, 'Opp', 3, '2026-09-30 23:59:00', NULL, '2026-10-09 21:02:48'),
(19, 24, 'Opp', 3, '2026-10-01 00:00:00', NULL, '2026-10-09 21:02:48'),
(24, 23, 'Inject', 3, '2026-10-05 00:00:00', NULL, '2026-10-09 21:02:51'),
(26, 27, 'Opp', 3, '2026-10-06 10:00:00', NULL, '2026-10-09 21:02:52'),
(27, 27, 'Opp', 3, '2026-09-29 10:00:00', NULL, '2026-10-09 21:02:52'),
(28, 22, 'rival', 3, '2026-10-05 00:00:00', NULL, '2026-10-09 21:02:52'),
(29, 22, 'RIVAL', 3, '2026-10-05 00:00:00', NULL, '2026-10-09 21:02:52'),
(30, 22, 'Pg00', 3, '2026-09-01 12:00:00', NULL, '2026-10-09 21:02:54'),
(31, 22, 'Pg01', 3, '2026-09-02 12:00:00', NULL, '2026-10-09 21:02:54'),
(32, 22, 'Pg02', 3, '2026-09-03 12:00:00', NULL, '2026-10-09 21:02:54'),
(33, 22, 'Pg03', 3, '2026-09-04 12:00:00', NULL, '2026-10-09 21:02:54'),
(34, 22, 'Pg04', 3, '2026-09-05 12:00:00', NULL, '2026-10-09 21:02:54'),
(35, 22, 'Pg05', 3, '2026-09-06 12:00:00', NULL, '2026-10-09 21:02:54'),
(36, 22, 'Pg06', 3, '2026-09-07 12:00:00', NULL, '2026-10-09 21:02:54'),
(37, 22, 'Pg07', 3, '2026-09-08 12:00:00', NULL, '2026-10-09 21:02:54'),
(38, 22, 'Pg08', 3, '2026-09-09 12:00:00', NULL, '2026-10-09 21:02:54'),
(39, 22, 'Pg09', 3, '2026-09-10 12:00:00', NULL, '2026-10-09 21:02:54'),
(40, 22, 'Pg10', 3, '2026-09-11 12:00:00', NULL, '2026-10-09 21:02:54'),
(41, 22, 'Pg11', 3, '2026-09-12 12:00:00', NULL, '2026-10-09 21:02:54'),
(42, 22, 'Pg12', 3, '2026-09-13 12:00:00', NULL, '2026-10-09 21:02:54'),
(43, 22, 'Pg13', 3, '2026-09-14 12:00:00', NULL, '2026-10-09 21:02:54'),
(44, 22, 'Pg14', 3, '2026-09-15 12:00:00', NULL, '2026-10-09 21:02:54'),
(45, 22, 'Pg15', 3, '2026-09-16 12:00:00', NULL, '2026-10-09 21:02:54'),
(46, 22, 'Pg16', 3, '2026-09-17 12:00:00', NULL, '2026-10-09 21:02:54'),
(47, 22, 'Pg17', 3, '2026-09-18 12:00:00', NULL, '2026-10-09 21:02:54'),
(48, 22, 'Pg18', 3, '2026-09-19 12:00:00', NULL, '2026-10-09 21:02:54'),
(49, 22, 'Pg19', 3, '2026-09-20 12:00:00', NULL, '2026-10-09 21:02:54'),
(50, 22, 'Pg20', 3, '2026-09-21 12:00:00', NULL, '2026-10-09 21:02:54'),
(53, 22, 'EvenBo', 2, '2026-10-05 00:00:00', NULL, '2026-10-09 21:02:55'),
(54, 22, 'Team Bravo', 5, '2030-02-01 20:00:00', 1, '2026-10-09 21:02:56'),
(55, 23, 'Team Alpha', 5, '2030-02-01 20:00:00', 1, '2026-10-09 21:02:56');

-- --------------------------------------------------------

--
-- Table structure for table `teams`
--

CREATE TABLE `teams` (
  `team_id` int(11) NOT NULL,
  `team_name` varchar(100) NOT NULL,
  `team_tag` varchar(10) NOT NULL,
  `leader_id` int(11) DEFAULT NULL COMMENT 'โค้ชของทีม (NULL = ไม่มีโค้ช)',
  `discord_link` varchar(255) DEFAULT NULL,
  `facebook_link` varchar(255) DEFAULT NULL,
  `line_id` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `teams`
--

INSERT INTO `teams` (`team_id`, `team_name`, `team_tag`, `leader_id`, `discord_link`, `facebook_link`, `line_id`, `created_at`) VALUES
(18, 'zboy', 'ZB', 2, NULL, NULL, NULL, '2026-09-05 12:06:08'),
(22, 'Team Alpha', 'TA', 20, 'https://discord.gg/alpha', NULL, '@alpha', '2026-10-09 21:02:47'),
(23, 'Team Bravo', 'TB', 27, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(24, 'Team Echo', 'TE', 28, NULL, NULL, NULL, '2026-10-09 21:02:48'),
(27, 'Team Foxtrot', 'TF', 21, NULL, NULL, NULL, '2026-10-09 21:02:51');

-- --------------------------------------------------------

--
-- Table structure for table `team_members`
--

CREATE TABLE `team_members` (
  `member_id` int(11) NOT NULL,
  `team_id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL COMMENT 'บัญชีที่เพิ่มรายชื่อ (ไม่ใช่บัญชีของผู้เล่น — D-11)',
  `in_game_name` varchar(100) NOT NULL,
  `main_role` varchar(50) DEFAULT NULL,
  `nickname` varchar(100) DEFAULT NULL COMMENT 'ชื่อเล่น',
  `fullname` varchar(255) DEFAULT NULL COMMENT 'ชื่อ-นามสกุลจริง',
  `open_id` varchar(100) DEFAULT NULL COMMENT 'OpenID ในเกม',
  `full_id` varchar(100) DEFAULT NULL COMMENT 'Full ID ตัวละคร',
  `current_rank` varchar(50) DEFAULT NULL COMMENT 'แรงก์ปัจจุบัน',
  `contact` varchar(255) DEFAULT NULL COMMENT 'ช่องทางติดต่อ เช่น Line / Discord',
  `member_note` text DEFAULT NULL COMMENT 'หมายเหตุ ฮีโร่ถนัด ฯลฯ',
  `info_updated_at` datetime DEFAULT NULL COMMENT 'แก้ไขข้อมูลส่วนตัวล่าสุด',
  `joined_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `team_members`
--

INSERT INTO `team_members` (`member_id`, `team_id`, `user_id`, `in_game_name`, `main_role`, `nickname`, `fullname`, `open_id`, `full_id`, `current_rank`, `contact`, `member_note`, `info_updated_at`, `joined_at`) VALUES
(55, 18, 2, 'yu', 'Dark Slayer', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-04 07:36:53'),
(56, 18, 2, 'pat', 'Jungle', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-04 07:36:58'),
(57, 18, 2, 'K', 'Mid Lane', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-04 07:37:10'),
(58, 18, 2, 'AA', 'Dragon Lane', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-04 07:37:16'),
(59, 18, 2, 'boy', 'Support', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-04 07:37:22'),
(60, 22, 20, 'A1', 'Dark Slayer', 'Ace', NULL, NULL, NULL, 'Conqueror', NULL, NULL, '2026-10-10 04:02:47', '2026-10-09 21:02:47'),
(61, 23, NULL, 'B1', 'Dark Slayer', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(62, 22, 20, 'A2', 'Jungle', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(63, 23, NULL, 'B2', 'Jungle', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(64, 22, 20, 'A3', 'Mid Lane', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(65, 23, NULL, 'B3', 'Mid Lane', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(66, 22, 20, 'A4', 'Dragon Lane', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(67, 23, NULL, 'B4', 'Dragon Lane', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(68, 22, 20, 'A5', 'Support', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:47'),
(70, 24, 28, 'E1', 'Jungle', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:48'),
(72, 27, 21, 'F1', 'Jungle', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-10-09 21:02:52');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `display_name` varchar(100) NOT NULL,
  `role` enum('user','admin') DEFAULT 'user',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `nickname` varchar(100) DEFAULT NULL,
  `fullname` varchar(255) DEFAULT NULL,
  `open_id` varchar(255) DEFAULT NULL,
  `full_id` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `username`, `email`, `password`, `display_name`, `role`, `created_at`, `nickname`, `fullname`, `open_id`, `full_id`) VALUES
(2, 'P1', 'P1@gmail.com', '$2y$10$qSdTDrYFz5oFLokUM9n4teuBTxbkyTbkCACI4oup.X6Yqb4TGc6gu', 'P1', 'user', '2026-08-28 18:45:50', NULL, NULL, NULL, NULL),
(3, 'P2', 'P2@gmail.com', '$2y$10$rNuTVE.HbpXwRQOyuD.cAuRwrPvLakbzLn.j4U0HXMj9yxa5mF1GC', 'P2', 'user', '2026-08-28 19:04:42', NULL, NULL, NULL, NULL),
(13, 'PungzZz', 'PungzZz@gmail.com', '$2y$10$pToZ6Q50JzBuH4I4TvLbsee3aT8xI6c9rmiZV3kYy8m3QheTXWtyK', 'PungzZz', 'admin', '2026-10-04 09:01:22', NULL, NULL, NULL, NULL),
(20, 't_leada', 't_leada@test.local', '$2y$10$/GgPGTzfXU5N75HmJYLbI.vrMhb2GkWvoVXexvXdY.LE9lBCPbAbK', 't_leada', 'user', '2026-10-09 21:02:45', NULL, NULL, NULL, NULL),
(21, 't_six', 't_six@test.local', '$2y$10$CbY4TNIVJW0nkZHzYDBgKOtoEH.Wf74rcnvVjW09uvdzQTsTjKz0y', 't_six', 'user', '2026-10-09 21:02:46', NULL, NULL, NULL, NULL),
(22, 't_admin', 't_admin@test.local', '$2y$10$F68XOkyKG8VBcvUmG9BaJOLCMgwo3wsvQOhhB8Pnso.pRYrlWunDi', 't_admin', 'admin', '2026-10-09 21:02:46', NULL, NULL, NULL, NULL),
(23, 't_admin2', 't_admin2@test.local', '$2y$10$ffyt/BrjD3Bh4GmAqCRf4uY9uGL4pY445.PyhQEzeyCvWGpTbv3Ya', 't_admin2', 'user', '2026-10-09 21:02:46', NULL, NULL, NULL, NULL),
(27, 't_d', 't_d@test.local', '$2y$10$GzVLcepNysf8.5A.QMHl/.TmbVUc2hlNhfL2z3c/f8AzZ54NSkA3m', 't_d', 'user', '2026-10-09 21:02:46', NULL, NULL, NULL, NULL),
(28, 't_e', 't_e@test.local', '$2y$10$wF1zI5un8vfVvuO6GZbtBeo8/nUIKPIVduNY1Om5IgP62VRRUck82', 't_e', 'user', '2026-10-09 21:02:46', NULL, NULL, NULL, NULL),
(29, 'pg_user00', 'pg00@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(30, 'pg_user01', 'pg01@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(31, 'pg_user02', 'pg02@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(32, 'pg_user03', 'pg03@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(33, 'pg_user04', 'pg04@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(34, 'pg_user05', 'pg05@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(35, 'pg_user06', 'pg06@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(36, 'pg_user07', 'pg07@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(37, 'pg_user08', 'pg08@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(38, 'pg_user09', 'pg09@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(39, 'pg_user10', 'pg10@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(40, 'pg_user11', 'pg11@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(41, 'pg_user12', 'pg12@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(42, 'pg_user13', 'pg13@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(43, 'pg_user14', 'pg14@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(44, 'pg_user15', 'pg15@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:54', NULL, NULL, NULL, NULL),
(45, 'pg_user16', 'pg16@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:55', NULL, NULL, NULL, NULL),
(46, 'pg_user17', 'pg17@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:55', NULL, NULL, NULL, NULL),
(47, 'pg_user18', 'pg18@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:55', NULL, NULL, NULL, NULL),
(48, 'pg_user19', 'pg19@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:55', NULL, NULL, NULL, NULL),
(49, 'pg_user20', 'pg20@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:55', NULL, NULL, NULL, NULL),
(50, 'pg_user21', 'pg21@test.local', 'x', 'PG', 'user', '2026-10-09 21:02:55', NULL, NULL, NULL, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `heroes`
--
ALTER TABLE `heroes`
  ADD PRIMARY KEY (`hero_id`),
  ADD UNIQUE KEY `hero_name` (`hero_name`);

--
-- Indexes for table `login_attempts`
--
ALTER TABLE `login_attempts`
  ADD PRIMARY KEY (`attempt_id`),
  ADD KEY `login_key` (`login_key`,`attempted_at`);

--
-- Indexes for table `match_player_stats`
--
ALTER TABLE `match_player_stats`
  ADD PRIMARY KEY (`stat_id`),
  ADD KEY `match_id` (`match_id`),
  ADD KEY `member_id` (`member_id`);

--
-- Indexes for table `scrim_matches`
--
ALTER TABLE `scrim_matches`
  ADD PRIMARY KEY (`match_id`),
  ADD KEY `team_id` (`team_id`),
  ADD KEY `series_id` (`series_id`);

--
-- Indexes for table `scrim_posts`
--
ALTER TABLE `scrim_posts`
  ADD PRIMARY KEY (`post_id`),
  ADD KEY `team_id` (`team_id`);

--
-- Indexes for table `scrim_requests`
--
ALTER TABLE `scrim_requests`
  ADD PRIMARY KEY (`request_id`),
  ADD UNIQUE KEY `post_team` (`post_id`,`team_id`),
  ADD KEY `team_id` (`team_id`);

--
-- Indexes for table `scrim_series`
--
ALTER TABLE `scrim_series`
  ADD PRIMARY KEY (`series_id`),
  ADD KEY `team_id` (`team_id`),
  ADD KEY `request_id` (`request_id`);

--
-- Indexes for table `teams`
--
ALTER TABLE `teams`
  ADD PRIMARY KEY (`team_id`),
  ADD UNIQUE KEY `team_name` (`team_name`),
  ADD KEY `leader_id` (`leader_id`);

--
-- Indexes for table `team_members`
--
ALTER TABLE `team_members`
  ADD PRIMARY KEY (`member_id`),
  ADD KEY `team_id` (`team_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `heroes`
--
ALTER TABLE `heroes`
  MODIFY `hero_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;

--
-- AUTO_INCREMENT for table `login_attempts`
--
ALTER TABLE `login_attempts`
  MODIFY `attempt_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `match_player_stats`
--
ALTER TABLE `match_player_stats`
  MODIFY `stat_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=334;

--
-- AUTO_INCREMENT for table `scrim_matches`
--
ALTER TABLE `scrim_matches`
  MODIFY `match_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;

--
-- AUTO_INCREMENT for table `scrim_posts`
--
ALTER TABLE `scrim_posts`
  MODIFY `post_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `scrim_requests`
--
ALTER TABLE `scrim_requests`
  MODIFY `request_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `scrim_series`
--
ALTER TABLE `scrim_series`
  MODIFY `series_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `teams`
--
ALTER TABLE `teams`
  MODIFY `team_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `team_members`
--
ALTER TABLE `team_members`
  MODIFY `member_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `match_player_stats`
--
ALTER TABLE `match_player_stats`
  ADD CONSTRAINT `match_player_stats_ibfk_1` FOREIGN KEY (`match_id`) REFERENCES `scrim_matches` (`match_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `match_player_stats_ibfk_2` FOREIGN KEY (`member_id`) REFERENCES `team_members` (`member_id`) ON DELETE CASCADE;

--
-- Constraints for table `scrim_matches`
--
ALTER TABLE `scrim_matches`
  ADD CONSTRAINT `scrim_matches_ibfk_1` FOREIGN KEY (`team_id`) REFERENCES `teams` (`team_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `scrim_matches_ibfk_2` FOREIGN KEY (`series_id`) REFERENCES `scrim_series` (`series_id`) ON DELETE SET NULL;

--
-- Constraints for table `scrim_posts`
--
ALTER TABLE `scrim_posts`
  ADD CONSTRAINT `scrim_posts_ibfk_1` FOREIGN KEY (`team_id`) REFERENCES `teams` (`team_id`) ON DELETE CASCADE;

--
-- Constraints for table `scrim_requests`
--
ALTER TABLE `scrim_requests`
  ADD CONSTRAINT `scrim_requests_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `scrim_posts` (`post_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `scrim_requests_ibfk_2` FOREIGN KEY (`team_id`) REFERENCES `teams` (`team_id`) ON DELETE CASCADE;

--
-- Constraints for table `scrim_series`
--
ALTER TABLE `scrim_series`
  ADD CONSTRAINT `scrim_series_ibfk_1` FOREIGN KEY (`team_id`) REFERENCES `teams` (`team_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `scrim_series_ibfk_2` FOREIGN KEY (`request_id`) REFERENCES `scrim_requests` (`request_id`) ON DELETE SET NULL;

--
-- Constraints for table `teams`
--
ALTER TABLE `teams`
  ADD CONSTRAINT `teams_ibfk_1` FOREIGN KEY (`leader_id`) REFERENCES `users` (`user_id`) ON DELETE SET NULL;

--
-- Constraints for table `team_members`
--
ALTER TABLE `team_members`
  ADD CONSTRAINT `team_members_ibfk_1` FOREIGN KEY (`team_id`) REFERENCES `teams` (`team_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `team_members_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
